<?php

return [
    '1.0.0' => [
        '支持单图裁剪',
    ],
    '1.0.1' => [
        'fixed bugs',
    ],
    '1.0.2' => [
        '修复初始裁剪比率',
    ],
    '1.0.3' => [
        '执行intervention/image方法',
    ],
    '1.0.4' => [
        '修复非必填时错误',
    ],
    '1.0.5' => [
        '新增多比例预设，分辨率重置',
    ],
    '1.0.6' => [
        '修复原图',
    ],
    '1.0.7' => [
        '支持同文件重复裁剪',
    ],
    '1.1.0' => [
        '改用Alpinejs技术，增加多图裁剪'
    ],
    '1.1.1' => [
        '修复图片加载失败后处理，一些优化'
    ],
    '1.1.2' => [
        '修复intervention调用'
    ],
    '1.1.3' => [
        '默认采用预上传图片，新增jpeg方法'
    ],
    '1.1.4' => [
        '修复图片更换'
    ]
];
